#!/bin/sh
#------------------------------------------------------------------------------
# Copyright (c) 2011，中兴通讯股份有限公司，All rights reserved.
# 
# 文件名称：host_handle.sh
# 文件标识：
# 内容摘要：执行各种预定义命令
# 当前版本：1.0
# 作    者：袁进坤
# 完成日期：2011年9月1日
#
# 修改记录1：
#     修改日期：2011/9/1
#     版 本 号：V1.0
#     修 改 人：袁进坤
#     修改内容：创建
#------------------------------------------------------------------------------

#------------------------------------------------------------------------------
case $1 in
reboot		) reboot 	$2 $3 $4 $5 $6 $7 $8 $9;;
shutdown	) halt 		$2 $3 $4 $5 $6 $7 $8 $9;;
*			) echo "Undefined command: $1";;
esac

exit 0