/*******************************************************************************
* Copyright (c) 2011，中兴通讯股份有限公司，All rights reserved.
*
* 文件名称：vna_pub.h
* 文件标识：见配置管理计划书
* 内容摘要：VNA进程需要包含的头文件
* 当前版本：1.0
* 作    者：lvech
* 完成日期：2013年1月9日
*
* 修改记录1：
*     修改日期：2013/1/9
*     版 本 号：V1.0
*     修 改 人：lvech
*     修改内容：创建
*******************************************************************************/
#ifndef VNA_PUB_H
#define VNA_PUB_H


#include "vnetlib_common.h"


#endif // #ifndef VNA_PUB_H

