#!/usr/bin/python
# -*- coding: gb2312 -*-
#*******************************************************************************
# Copyright (c) 2012，中兴通讯股份有限公司，All rights reserved.
# 
# 文件名称：dhcp_global.py
# 测试内容：dhcp_global模块xmlrpc接口封装
# 当前版本：1.0 
# 作    者：刘雪峰
# 完成日期：2012/04/12
#
# 修改记录1：
#    修改日期：2012/04/12
#    版 本 号：V1.0
#    修 改 人：刘雪峰
#    修改内容：创建
# 修改记录2：
#    修改日期：2012/06/6
#    版 本 号：V2.0
#    修 改 人：陈志伟
#    修改内容：删除废弃的，移到dhcp.py里面
#*******************************************************************************/
 

